Workspace/run/07-sineWaveDamping-outlet-pressure-NRINSCBC-backward-300hz-etaAc0.01/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

acousticDampingSource
{
    type            acousticDampingSource;
    active          no;

    acousticDampingSourceCoeffs
    {
        timeStart        0.004;
        duration         1000.0;
        selectionMode    all;
        origin           (-1.25 0 0);
        radius1          1.2;
        radius2          1.65;
        frequency        3000;
        URef             UMean;
    }
}


//************************************************************************* //
